UmeshChandargi/My_Projects/PSOC5_Projects/Electronic_Gaspedal_1.0.0.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ErikaOS_1_ee.h"
#include "ErikaOS_1_ee_tracing.h"
#include "JOYSTICK_ADC_XY.h"
#include "JOYSTICK_ADC_X_aliases.h"
#include "JOYSTICK_ADC_X.h"
#include "JOYSTICK_ADC_Y_aliases.h"
#include "JOYSTICK_ADC_Y.h"
#include "UART_LOG.h"
#include "Clock_1.h"
#include "PWM_RGB_G.h"
#include "led_rgb_g_aliases.h"
#include "led_rgb_g.h"
#include "Brakelight_LED_RED_aliases.h"
#include "Brakelight_LED_RED.h"
#include "WDT_Button_aliases.h"
#include "WDT_Button.h"
#include "isr_button1.h"
#include "JOYSTICK_ADC_XY_SAR.h"
#include "JOYSTICK_ADC_XY_IntClock.h"
#include "JOYSTICK_ADC_XY_TempBuf_dma.h"
#include "JOYSTICK_ADC_XY_FinalBuf_dma.h"
#include "JOYSTICK_ADC_XY_IRQ.h"
#include "UART_LOG_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

